src/cf/InformationRegisters/ОтслеживаниеИсточниковПривлечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОтслеживаниеИсточниковПривлечения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеКИДляПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсточникПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКИ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеКИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОтслеживаниеИсточниковПривлечения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Источник привлечения связанный с контактной информацией
//
// Параметры:
//  - ЗначениеКИ - Строка - значение контактной информации
//  - ЭтоОтслеживаниеНомеров - Булево
//
// Возвращаемое значение:
//  - СправочникСсылка.ИсточникиПривлеченияПокупателей
//
Функция ПолучитьИсточникПривлеченияПоКИ(ЗначениеКИ, ЭтоОтслеживаниеНомеров = Ложь) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтслеживаниеИсточниковПривлечения.ИсточникПривлечения КАК ИсточникПривлечения
	|ИЗ
	|	РегистрСведений.ОтслеживаниеИсточниковПривлечения КАК ОтслеживаниеИсточниковПривлечения
	|ГДЕ
	|	ОтслеживаниеИсточниковПривлечения.ЗначениеКИ ПОДОБНО &ЗначениеКИ
	|	И НЕ ОтслеживаниеИсточниковПривлечения.ИсточникПривлечения.Недействителен";
	
	Если ЭтоОтслеживаниеНомеров Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОтслеживаниеИсточниковПривлечения.ЗначениеКИ", "ОтслеживаниеИсточниковПривлечения.ЗначениеКИДляПоиска");
		ЗначениеКИ = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(ЗначениеКИ);
	КонецЕсли;

	Запрос.УстановитьПараметр("ЗначениеКИ", ЗначениеКИ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ИсточникПривлечения;
	КонецЦикла;
	
	Возврат Справочники.ИсточникиПривлеченияПокупателей.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
